{
  "trend": "fff",
  "category": "memes",
  "platforms": {
    "tiktok": true,
    "instagram": true
  },
  "platform_count": 2,
  "metrics": {
    "google": {
      "searches": "0",
      "raw": 0
    },
    "x": {
      "posts": "0",
      "reposts": "0",
      "raw_posts": 0,
      "raw_reposts": 0
    },
    "tiktok": {
      "views": "8.5M",
      "videos": "332.6K",
      "raw_views": 8523248
    },
    "instagram": {
      "posts": "6.1M",
      "reach": "30.3M",
      "raw_posts": 6124574
    }
  },
  "signal_score": 90,
  "momentum": "rising",
  "lifecycle": "new",
  "locations": [
    "global"
  ],
  "related_trends": [
    "#fff",
    "#FFFFFF"
  ],
  "analysis": {
    "headline": "The Viral Allure of the Simplest Color: fff Captivates the Internet",
    "summary": "The mysterious trend of the hexadecimal code 'fff' has taken the internet by storm, sparking a wave of creativity and intrigue across TikTok and Instagram. This seemingly innocuous color has become a powerful symbol, resonating with users worldwide.",
    "origin_story": "The 'fff' trend first emerged on TikTok, where users began creating minimalist content centered around the pure, white color. The trend quickly spread to Instagram, where it has amassed millions of posts and engagements.",
    "expert_analysis": "The 'fff' trend taps into a deeper human desire for simplicity and minimalism in a digital landscape often overwhelmed by visual noise. This trend suggests a collective yearning for a respite from the constant bombardment of information, allowing users to focus on the beauty of the most basic elements.",
    "impact": "The widespread appeal of 'fff' highlights the internet's power to transform the mundane into the captivating, showcasing the power of digital communities to rally around the most unexpected of phenomena.",
    "status": "viral"
  },
  "timestamp": "2026-02-06T19:49:59.396182+00:00",
  "history": [
    {
      "timestamp": "2026-02-06T15:05:48.293420+00:00",
      "signal_score": 90
    },
    {
      "timestamp": "2026-02-06T17:31:23.171892+00:00",
      "signal_score": 90
    },
    {
      "timestamp": "2026-02-06T19:49:59.396197+00:00",
      "signal_score": 90
    }
  ]
}