{
  "trend": "fff",
  "category": "culture",
  "platforms": {
    "tiktok": true,
    "instagram": true
  },
  "platform_count": 2,
  "metrics": {
    "google": {
      "searches": "0",
      "raw": 0
    },
    "x": {
      "posts": "0",
      "reposts": "0",
      "raw_posts": 0,
      "raw_reposts": 0
    },
    "tiktok": {
      "views": "64.4M",
      "videos": "28.2K",
      "raw_views": 64443719
    },
    "instagram": {
      "posts": "5.6M",
      "reach": "18.7M",
      "raw_posts": 5594261
    }
  },
  "signal_score": 90,
  "momentum": "rising",
  "lifecycle": "new",
  "locations": [
    "global"
  ],
  "related_trends": [
    "#fff",
    "#FFFFFF"
  ],
  "analysis": {
    "headline": "The Blinding Allure of '#fff': Exploring the Viral Minimalist Trend",
    "summary": "The '#fff' hashtag, signifying the hexadecimal code for the color white, has taken social media by storm. Across TikTok and Instagram, users are captivating audiences with mesmerizing visuals and minimalist aesthetics centered around this simple yet striking hue.",
    "origin_story": "The '#fff' trend first gained traction on TikTok, where users began sharing videos showcasing clean, white-themed backdrops, fashion, and home decor. The trend quickly spread to Instagram, where a surge of posts showcasing the same visual language have amassed millions of engagements.",
    "expert_analysis": "This viral trend reflects a growing desire for visual simplicity and serenity in a cluttered digital landscape. The allure of '#fff' lies in its ability to create a sense of calm and focus, offering a respite from the sensory overload that often characterizes social media. At a deeper level, the trend may also signify a cultural yearning for minimalism, mindfulness, and a return to the essentials.",
    "impact": "The widespread popularity of '#fff' has the potential to influence design trends, consumer behavior, and even mindset shifts, as people seek to integrate the aesthetics of simplicity and purity into their online and offline lives.",
    "status": "viral"
  },
  "timestamp": "2026-02-06T21:04:10.084088+00:00",
  "history": [
    {
      "timestamp": "2026-02-06T15:05:48.293420+00:00",
      "signal_score": 90
    },
    {
      "timestamp": "2026-02-06T17:31:23.171892+00:00",
      "signal_score": 90
    },
    {
      "timestamp": "2026-02-06T19:49:59.396197+00:00",
      "signal_score": 90
    },
    {
      "timestamp": "2026-02-06T21:04:10.084103+00:00",
      "signal_score": 90
    }
  ]
}