{
  "trend": "super bowl trends betting",
  "category": "sports",
  "platforms": {
    "google": true
  },
  "platform_count": 1,
  "metrics": {
    "google": {
      "searches": "190.6K",
      "raw": 190631
    },
    "x": {
      "posts": "0",
      "reposts": "0",
      "raw_posts": 0,
      "raw_reposts": 0
    },
    "tiktok": {
      "views": "0",
      "videos": "0",
      "raw_views": 0
    },
    "instagram": {
      "posts": "0",
      "reach": "0",
      "raw_posts": 0
    }
  },
  "signal_score": 50,
  "momentum": "stable",
  "lifecycle": "peak",
  "locations": [
    "global"
  ],
  "related_trends": [],
  "analysis": {
    "headline": "Super Bowl Betting Fever Grips the Nation as Big Game Approaches",
    "summary": "With the biggest sporting event of the year just around the corner, Americans are flocking to online platforms to research and place bets on the outcome of the Super Bowl. This surge in betting interest reflects the growing popularity and mainstream acceptance of sports gambling in the U.S.",
    "origin_story": "The increased search activity around Super Bowl betting can be traced to the Supreme Court's 2018 decision to overturn the federal ban on sports betting, paving the way for individual states to legalize the practice.",
    "expert_analysis": "The spike in Super Bowl betting interest highlights how sports gambling has become deeply embedded in the American sports landscape. Fans are no longer just passive viewers, but active participants looking to profit off the game's outcome. This trend reflects a broader cultural shift towards monetizing fan engagement and transforming sports into an interactive entertainment experience.",
    "impact": "With billions of dollars expected to be wagered on the Super Bowl, the proliferation of sports betting will have significant implications for the sports industry, media companies, and state governments that have legalized the practice.",
    "status": "viral"
  },
  "timestamp": "2026-02-06T19:50:42.713197+00:00",
  "history": [
    {
      "timestamp": "2026-02-06T10:48:29.869056+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T11:08:59.208063+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T15:06:37.875562+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T17:32:09.075722+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T19:50:42.713212+00:00",
      "signal_score": 50
    }
  ]
}