{
  "trend": "taylor swift trending songs",
  "category": "music",
  "platforms": {
    "google": true
  },
  "platform_count": 1,
  "metrics": {
    "google": {
      "searches": "106.9K",
      "raw": 106928
    },
    "x": {
      "posts": "0",
      "reposts": "0",
      "raw_posts": 0,
      "raw_reposts": 0
    },
    "tiktok": {
      "views": "0",
      "videos": "0",
      "raw_views": 0
    },
    "instagram": {
      "posts": "0",
      "reach": "0",
      "raw_posts": 0
    }
  },
  "signal_score": 50,
  "momentum": "stable",
  "lifecycle": "peak",
  "locations": [
    "global"
  ],
  "related_trends": [
    "taylor swift trending songs",
    "taylor swift trending"
  ],
  "analysis": {
    "headline": "Taylor Swift's Catalog Sparks Renewed Interest Across Platforms",
    "summary": "Taylor Swift's vast and acclaimed musical catalog has once again captured the attention of fans and music enthusiasts alike, with a surge in Google searches for her trending songs. This renewed interest highlights the enduring popularity and cultural impact of the acclaimed singer-songwriter.",
    "origin_story": "The spike in Google searches for Taylor Swift's trending songs appears to have been sparked by a combination of recent album re-recordings and ongoing discussions around her music and career.",
    "expert_analysis": "This trend underscores the deep connection Swift has forged with her fanbase, who continue to explore and rediscover her extensive discography. It also reflects the broader cultural significance of her artistry, which has transcended mere commercial success to become a touchstone for discussions around creative control, artistic integrity, and the evolving music industry.",
    "impact": "The sustained interest in Taylor Swift's catalog is likely to drive increased streaming, sales, and media coverage, further cementing her status as one of the most influential and beloved artists of her generation.",
    "status": "rising"
  },
  "timestamp": "2026-02-08T09:59:35.206255+00:00",
  "history": [
    {
      "timestamp": "2026-02-06T21:04:50.971929+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-08T00:02:23.933139+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-08T05:42:09.235051+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-08T07:51:32.074745+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-08T09:59:35.206271+00:00",
      "signal_score": 50
    }
  ]
}