{
  "trend": "trump trending",
  "category": "politics",
  "platforms": {
    "google": true
  },
  "platform_count": 1,
  "metrics": {
    "google": {
      "searches": "253.3K",
      "raw": 253349
    },
    "x": {
      "posts": "0",
      "reposts": "0",
      "raw_posts": 0,
      "raw_reposts": 0
    },
    "tiktok": {
      "views": "0",
      "videos": "0",
      "raw_views": 0
    },
    "instagram": {
      "posts": "0",
      "reach": "0",
      "raw_posts": 0
    }
  },
  "signal_score": 50,
  "momentum": "stable",
  "lifecycle": "peak",
  "locations": [
    "global"
  ],
  "related_trends": [
    "trump trending",
    "trump trending news",
    "trump trending news today",
    "trump trending now",
    "trump trending photo"
  ],
  "analysis": {
    "headline": "Trump Dominates Google Searches as Controversial Figure Remains in Spotlight",
    "summary": "Former President Donald Trump has once again captured the public's attention, with his name dominating Google searches in recent days. This surge of interest reflects the ongoing fascination and polarization surrounding one of the most divisive political figures of our time.",
    "origin_story": "Trump's name has been a consistent top search term on Google, a trend that has persisted since his time in the White House and the events surrounding the 2020 election.",
    "expert_analysis": "Trump's ability to command the spotlight, even after leaving office, speaks to the enduring influence of his brand and the deep divisions he has sown within American politics. This trend highlights the power of online search as a barometer of public interest and the enduring impact of Trump's polarizing presence in the national discourse.",
    "impact": "The sustained interest in Trump on Google could shape media coverage, public discourse, and even the political landscape as the nation grapples with the lasting effects of his presidency.",
    "status": "viral"
  },
  "timestamp": "2026-02-06T21:04:35.980610+00:00",
  "history": [
    {
      "timestamp": "2026-02-06T15:06:29.758917+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T17:32:01.621019+00:00",
      "signal_score": 50
    },
    {
      "timestamp": "2026-02-06T21:04:35.980624+00:00",
      "signal_score": 50
    }
  ]
}